texts = {}

texts["help"] = (
    "🤖 Мультичат-бот — Справка\n\n"
    "Привет! Этот бот связывает аккаунты в мессенджерах, чтобы вы могли общаться между платформами в одном окне.\n\n"
    "📌 Команды:\n"
    "🔹 `/start` — Показать ваш секретный ключ.\n"
    "🔹 /message [ключ] [название] — Начать диалог с пользователем. Название необязательно. Если указать название, чат будет сохранён для быстрого доступа.\n"
    "🔹 `/quit` — Завершить текущий диалог.\n"
    "🔹 `/help` — Открыть эту справку.\n"
    "🔹 `/status` — Узнать состоите ли вы в данный момент в чате.\n\n"
    "⚠️ Важно:\n"
    "В активном диалоге все сообщения отправляются собеседнику. "
    "Чтобы выйти из беседы, напишите `/quit`."
)

texts["err_secret"] = "❌ Ошибка: неверный ключ пользователя."
texts["empty_secret"] = "Отсутствует ключ пользователя."
texts["start_chat"] = "✅ Диалог начат, собеседник на связи!"
texts["err_new_chat"] = "⚠️ Вы уже в активном диалоге. Сначала завершите его через `/quit`."
texts["end_chat"] = "📴 Диалог завершен."
texts["not_in_chat"] = "ℹ️ Вы сейчас не общаетесь в диалоге."
texts["vk_video_err"] = "⚠️ Из-за ограничений ВКонтакте передать видео напрямую не получится."
texts["err_type"] = "🚫 Такой тип сообщений бот пока не поддерживает."
texts["err_sticker"] = "🚫 Такой тип стикеров пока не поддерживается."

texts["err"] = "💥 Что-то пошло не так. Пожалуйста, попробуйте позже."
texts["start_bottom"] = "Ваш секретный ключ для этого мессенджера:"
texts["status"] = "Сейчас вы общаетесь с:"
texts["user_not_found"] = "Пользователь не найден, диалог закрыт."
texts["time_out"] = "Диалог закрыт из-за долгого отсутствия активности."
texts["err_type_answer"] = "🚫 В данный момент отправка такого типа сообщений не поддерживается у получателя"
